CSI API ETABS v1
cDesignShearWall.GetRebarPrefsSpandrel Method
 Retrieves data from the Rebar Selection Rules for Wall Spandrels
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarPrefsSpandrel(
	int Item,
	ref string Value
)
Function GetRebarPrefsSpandrel (
	Item As Integer,
	ByRef Value As String
) As Integer
Dim instance As cDesignShearWall
Dim Item As Integer
Dim Value As String
Dim returnValue As Integer
returnValue = instance.GetRebarPrefsSpandrel(Item,
	Value)
int GetRebarPrefsSpandrel(
	int Item,
	String^% Value
)
abstract GetRebarPrefsSpandrel :
        Item : int *
        Value : string byref -> int
Parameters
Item
Type: System.Int32
 An integer value corresponding to the data to be retrieved, from the following list
Horizontal Top/Bottom Bars - Smallest bar size
Horizontal Top/Bottom Bars - Largest bar size
Horizontal Top/Bottom Bars - Preferred bar size
Horizontal Web Bars - Bar size
Horizontal Web Bars - Minimum Spacing of Bars
Horizontal Web Bars - Maximum Spacing of Bars
Vertical Bars/Ties - Stirrup Bar size
Vertical Bars/Ties - Minimum Spacing of Bars
Vertical Bars/Ties - Maximum Spacing of Bars
Diagonal Bars - Smallest bar size
Diagonal Bars - Largest bar size
Diagonal Bars - Preferred bar size
Diagonal Bar Ties - Stirrup bar size
Diagonal Bar Ties - Minimum Spacing of ties
Diagonal Bar Ties - Maximum Spacing of ties
Value
Type: System.String
 The retrieved data; note that numerical values are converted to String
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise returns non-zero
See Also
Reference
cDesignShearWall Interface
ETABSv1 Namespace